app/controllers/produtos_controller.rb

SELECT  "produtos".* FROM "produtos"  ORDER BY "produtos"."nome" ASC LIMIT 5
SELECT  "produtos".* FROM "produtos"  ORDER BY "produtos"."preco" ASC LIMIT 2
---
	def index
		@produtos_por_nome = Produto.order(:nome).limit 5
		@produtos_por_preco = Produto.order(:preco).limit 2

SELECT "departamentos".* FROM "departamentos"
---
	def new
		@produto = Produto.new
		@departamentos = Departamento.all

SELECT "produtos".* FROM "produtos" WHERE (nome like '%%')
---
	def busca
		@nome_a_buscar = params[:nome]
		@produtos = Produto.where "nome like ?", "%#{@nome_a_buscar}%"

INSERT INTO "produtos" ("nome", "descricao", "quantidade", "preco", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "Blusa P"], ["descricao", "Blusa do batman"], ["quantidade", 10], ["preco", 56.0], ["created_at", "2016-05-06 13:08:33.173484"], ["updated_at", "2016-05-06 13:08:33.173484"]]
---
	def create
		valores = params.require(:produto).permit :nome, :descricao, :quantidade, :preco, :departamento_id
		@produto = Produto.create valores